Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/tm/cuspy-level1.tmx
Source language: en_gb
Languages: fr_fr

source: Using such methods, the effect of noise (measurement noise of model structural noise) can also be taken into account by appropriately characterising it, for example, as white noise (if noise is uncorrelated) or as a stochastic process.
fr_fr: Avec ces méthodes, l'effet du bruit (erreur de mesure ou erreur structurelle du modèle) peuvent être pris en considération aussi par le biais d'une caractérisation appropriée, par exemple, comme un bruit blanc (si le bruit n'est pas corrélé) ou comme un procès stochastique.

source: Using the results in a management setting: effect of climate change
fr_fr: Utilisation des résultats dans un scénario de gestion : l'effet du changement climatique

source: Using this method only the modified sections of text need to be translated again when modifications are made to the original documentation.
fr_fr: L'utilisation de cette méthode permet de traduire seulement les sections modifiées quand il y a des modifications de la modification originelle.

source: Usually the modeller aims to obtain a global optimum, and then assesses parameter and predictive uncertainty with respect to this optimum.
fr_fr: D'habitude le modélisateur essaye d'obtenir un optimum global, et après analyse l'incertitude des paramètres et prédictive par rapport à cet optimum.

source: Usually there is only one command (``dercom=1``).
fr_fr: D'habitude il y a une seule commande (``dercom=1``).

source: Validation may be considered as a test to assess the degree of coherence of simulations with the observed behaviour.
fr_fr: On peut considérer la validation comme un test pour évaluer le dégrée de cohérence des simulations avec le comportement observé.

source: Validation or, more appropriately, conditional validation consists in the evaluation of model performance to conditions that differ from calibration ones.
fr_fr: La validation ou, plus adroitement, validation conditionnelle consiste en l'évaluation de la performance du modèle sous des conditions différentes de celles de la calibration.

source: Value used to fill the predictions file (except time data).
fr_fr: Valeur utilisée pour remplir le fichier de prédictions (à exception des données de temps).

source: Variance decomposition methods.
fr_fr: Méthodes de décomposition de la variance.

source: Verification
fr_fr: Vérification

source: Visual and other analysis to detect bad model behaviour and to characterise overall performance.
fr_fr: Analyses visuelles et d'autre type pour identifier des mauvais comportements du modèle et pour caractériser la performance globale.

source: Water temperature varies more slowly than air temperature, and daily water temperature is best correlated to the average of air temperature in the previous days.
fr_fr: La température de l'eau varie plus lentement que la température de l'air, et la température de l'eau est mieux corrélée à la température de l'air des jours antérieurs.

source: We already showed above that the model has a nearly linear behaviour in the prior parameter space using Sobol's uncertainty method of decomposition of variance.
fr_fr: Nous avons déjà démontré que le modèle a un comportement presque linéaire dans l'espace des paramètres a priori en utilisant la méthode de Sobol de décomposition de la variance.

source: We can answer this question with Monte Carlo simulations.
fr_fr: On peut répondre cette question avec des simulations de Monte Carlo.

source: We can find several types of unidentifiability:
fr_fr: On peut trouver plusieurs types de manque d'identifiabilité :

source: We can investigate this question with the concept of data worth.
fr_fr: On peut investiguer cette question avec le concept de valeur des données.

source: We can see that, as expected, uncertainty is quite large at this point.
fr_fr: On peut voire que, comme c'était attendu, l'incertitude est assez large en ce moment.

source: We can see there is just a slight improvement in RMSE.
fr_fr: On peut voire qu'il y a juste une petite amélioration du RMSE.

source: We can use the results obtained here to analyse a management question: which would be the effect of climate change?
fr_fr: Nous pouvons utiliser les résultats obtenus ici pour analyser un problème de gestion management : quel serait l'effet du changement climatique ?

source: We describe next some of the files used by :func:`write_pest_files`.
fr_fr: On décrit à continuation quelques-uns des fichiers utilisés par :func:`write_pest_files`.

source: We find two main approaches to the analysis of predictive uncertainty:
fr_fr: On trouve deux approches principales à l'analyse d'incertitude prédictive :

source: We have followed the `PEP 08 -- Style Guide for Python Code <https://www.python.org/dev/peps/pep-0008/>`_.
fr_fr: Nous avons suivi la `Guide de style pour code Python PEP 08 <https://www.python.org/dev/peps/pep-0008/>`_.

source: We have followed the `PEP 257 -- Docstring Conventions <https://www.python.org/dev/peps/pep-0257/>`_ and the recommendations of the *Google Python Style Guide* for docstrings in functions (point `3.8.1 <http://google.github.io/styleguide/pyguide.html#383-functions-and-methods>`_).
fr_fr: Nous avons suivi les `Conventions Docstrings -- PEP 257 <https://www.python.org/dev/peps/pep-0257/>`_ et les recommandations de la *Google Python Style Guide* pour docstrings dans des fonctions (point `3.8.1 <http://google.github.io/styleguide/pyguide.html#383-functions-and-methods>`_).

source: We have implemented Sobol's method in this package.
fr_fr: On a implémenté la méthode de Sobol dans ce paquet.

source: We know water temperature is highly correlated to air temperature and that it can be estimated quite accurately using Eq.
fr_fr: On sait que la température de l'eau est très corrélée à la température de l'air et qu'elle peut être estimée avec assez de précision avec l'Éq.

source: We may consider a model has an approximately linear behaviour when the coefficient of determination of the linear regression model is higher than 0.7.
fr_fr: On peut considérer qu'un modèle a un comportement approximativement linéaire quand le coefficient de détermination du modèle de régression linéaire est supérieur à 0.7.

source: We mention here a few options:
fr_fr: On donne ci-dessous quelques options :

source: We note that the reduction in uncertainty for :math:`\mu` is less important than for the other parameters.
fr_fr: On peut noter que la réduction dans l'incertitude pour :math:`\mu` est beaucoup moins importante que pour les autres paramètres.

source: We note that uncertainty is not equal along the year.
fr_fr: On voit que l'incertitude n'est pas égale le long de l'année.

source: We see that the predictions are quite consistent with observations: most measurements are within the estimated ranges of predictive error.
fr_fr: On voit que les prédictions sont assez cohérentes avec les observations : la plupart des mesures sont dans les rangs estimés d'erreur prédictive.

source: We see the most valuable data to reduce forecast uncertainty is that which corresponds to the same period of the year.
fr_fr: On voit que les données qui ont plus de valeur pour réduire l'incertitude des prédictions sont celles qui correspondent à la même période de l'année.

source: We will use here the method of Sobol.
fr_fr: Nous utiliserons ici la méthode de Sobol.

source: We will use satellite measurements of surface temperature from the LakeSST dataset (Prats et al.
fr_fr: Nous utilisons des mesures par satellite de la température de la surface du jeu de données LakeSST (Prats et al.

source: We would thus need to concentrate our measurement efforts in the summer and winter.
fr_fr: On devrait donc concentrer ses efforts de mesure en été et hiver.

source: Welcome to ``cuspy``'s documentation!
fr_fr: Bienvenue à la documentation de ``cuspy`` !

source: What is the :mod:`cuspy` package?
fr_fr: Qu'est-ce que c'est le paquet :mod:`cuspy` ?

source: What they provide are possible realistic behaviours that approach the behaviour of the real system.
fr_fr: Ce qu'ils fournissent sont des possibles comportements réalistes qui s'approximent au comportement du système réel.

source: When :math:`S_i` is calculated using the Sobol's method, it may take negative values because of numeric inaccuracies when :math:`S_i` is near zero and the sample size is small.
fr_fr: Quand :math:`S_i` est calculé avec la méthode de Sobol, il peut prendre des valeurs négatives à cause d'imprécisions numériques quand :math:`S_i` est proche de zéro et la taille de l'échantillon est petite.

source: When choosing a method, we need to take into account computational cost (number of runs and time of calculation of the model) and parameter uncertainty.
fr_fr: Quand on sélectionne une méthode, il faut prendre en considération le coût computationnel (nombre d'exécutions et temps de calcul du modèle) et incertitude des paramètres.

source: When residuals have mean zero and are uncorrelated (white noise), Gavish & Donoho (2014) proposed an optimal threshold of :math:`2.858y_{med}`, where :math:`y_{med}` is the median singular value.
fr_fr: Quand les résidus ont une moyenne de zéro et ne sont pas corrélés (bruit blanc), Gavish & Donoho (2014) ont proposé un seuil optimal de :math:`2.858y_{med}`, où :math:`y_{med}` est la valeur singulière médiane.

source: When the conditions are optimal, i.e., there is a clear global optimum and there are no local optima, an automatic search algorithm may be used.
fr_fr: Quand les conditions sont optimales, c'est-à-dire, il y a un optimum global clair et il n'y a pas d'optimums locaux, un algorithme automatique de descente de pente peut être utilisé.

source: When the number of unknowns is greater than the number of observations, the system is underdetermined and the problem is ill-posed (and infinite solutions are possible).
fr_fr: Quand le nombre d'inconnues est majeur que le nombre d'observations, le système est sous-déterminé et le problème n'est pas bien posé (est il y a infinies possibles solutions).

source: When the uncertainty about the model parameters is high, it is preferable to use nonlinear methods.
fr_fr: Quand l'incertitude des paramètres du modèle est élevée, il est préférable d'utiliser des méthodes non linéaires.

source: When there is no information on the shape of the distribution of the parameter values, it is often assumed that they follow a uniform distribution, which can be considered a non-informative distribution.
fr_fr: Quand il n'y a pas d'information sur la forme de la distribution des valeurs des paramètres, on assume souvent qu'elles suivent une distribution uniforme, qui peut être considérée comme une distribution non informative.

source: When there is structural unidentifiability, there is "a lack of information about one or more model parameters and results in unbounded variation of the parameters even in the absence of noise." Solving structural unidentifiability may involve acquiring data about other model variables or using a different model structure.
fr_fr: Quand il y a manque d'identifiabilité, il y a "un manque d'information sur un ou plusieurs paramètres du modèle et produit une variation non borné des paramètres même en absence de bruit." La résolution du problème du manque d'identifiabilité structurale peut comporter l'acquisition de données sur d'autres variables du modèle ou l'utilisation d'une différente structure du modèle.

source: When using this method usually two indexes are calculated: first-order sensitivity index (:math:`S_i`) and total effect index (:math:`S_{T_i}`).
fr_fr: Quand on utilise cette méthode d'habitude on calcule deux indexes : l'index de sensitivité de premier ordre (:math:`S_i`) et l'index des effets totaux (:math:`S_{T_i}`).

source: Which are the factors that influence most the model output?
fr_fr: Quels sont les facteurs qu'influence le plus le retour du modèle ?

source: Which are the optimal regions in parameter space for calibration?
fr_fr: Quelles sont les régions optimales dans l'espace des paramètres pour la calibration ?

source: Which uncertainty method to use?
fr_fr: Quelle méthode d'incertitude utiliser ?

source: While models are invaluable tools for scientific research and management, they are not perfect and it is necessary for the modeller to be aware of their limitations.
fr_fr: Bien que les modèles soit des outils inestimable pour la recherche scientifique et la gestion, ils ne sont libres de défauts et il faut que le modélisateur soit conscient de leur limitations.

source: While sensitivity analysis is more centred on determining the factors that affect most the model output.
fr_fr: Alors que l'analyse de sensitivité est plus centré sur la détermination des facteurs qu'affectent les plus le retour du modèle.

source: Will generally be only conditional verification dependent on the range of tests carried out.
fr_fr: Il s'agit généralement seulement d'une vérification conditionnelle qui dépends de la portée des tests réalisés.

source: With Schur's complement analysis you can obtain the posterior uncertainty typing:
fr_fr: Avec l'analyse du complément de Schur vous pouvez obtenir l'incertitude a posteriori si vous tapez :

source: With the :class:`ErrVar` object, it is also possible to access the results of the identifiability analysis with:
fr_fr: Avec l'objet :class:`ErrVar`, il est possible aussi d'accéder aux résultats de l'analyse d'identifiabilité avec :

source: Working with models with other type of output is possible, but it requires more implication of the user in the preparation of the PEST instruction files.
fr_fr: Il est possible de travailler avec des modèles avec un autre type de sortie, mais il faut une majeure implication de l'utilisateur dans la préparation des fichiers d'instructions PEST.

source: Write PEST files
fr_fr: Écrit les fichiers de PEST.

source: Write PEST instruction file.
fr_fr: Écrit le fichier PEST d'instructions.

source: Write PEST template parameter file.
fr_fr: Écrit le fichier de paramètres modèle de PEST.

source: Write dictionary to file.
fr_fr: Écrit dictionnaire à un fichier.

source: Write parameter data file.
fr_fr: Écrit le fichier de données des paramètres.

source: Write predictions file filled with dummy values.
fr_fr: Écrit un fichier de prédictions avec des valeurs fictives.

source: Yes
fr_fr: Oui

source: You can also compile the user manual as a pdf file making:
fr_fr: Vous pouvez compiler aussi le manuel d'utilisation en pdf avec :

source: You can do the translation by hand by modifying the po files.
fr_fr: Vous pouvez faire la traduction manuellement modifiant les fichiers po.

source: You can do this manually, or you can use the function :func:`write_pest_files`.
fr_fr: Vous pouvez faire ça manuellement, ou vous pouvez utiliser la fonction :func:`write_pest_files`.

source: You can have multiple Python versions (2.x and 3.x) installed on the same system without problems using, for example, virtual environments.
fr_fr: Il est possible d'avoir plusieurs versions de Python (2.x et 3.x) installées sur le même système d'exploitation en utilisant, par exemple, les environnements virtuels.

source: You can include the previous commands in a Python script (see the scripts in the folder :file:`tests`).
fr_fr: Vous pouvez inclure les commandes précédentes dans un script Python (voyez les scripts d'exemple dans le dossier :file:`tests`).

source: You can test the application with example data provided in the folder :file:`example_data` and the OKP model implemented in the :mod:`okplm` package.
fr_fr: Vous pouvez tester le logiciel à l'aide des données d'exemple fourniesdans le dossier :file:`example_data` et le modèle OKP implementé dans le paquet :mod:`okplm`.

source: You may plot the results using:
fr_fr: Vous pouvez tracer les résultats en utilisant :

source: You may use ``pip`` to install the required packages.
fr_fr: Vous pouvez utiliser ``pip`` pour installer les paquets requis.

source: You need Python 3.6 or later to run the :mod:`cuspy` package.
fr_fr: Il est nécessaire d'avoir une version Python 3.6 ou ultérieure pour faire tourner le paquet :mod:`cuspy`.

source: You need to clone the :mod:`cuspy` package and :mod:`pestpp` source with git.
fr_fr: Vous devez cloner les paquets :mod:`okplm` et :mod:`pestpp` avec git.

source: You need to use the function :func:`gsa`, by choosing the desired method ('sobol' or 'morris') and configuring the method using the `pestpp_opts` argument.
fr_fr: Vous devez utiliser la fonction :func:`gsa`, et choisir la méthode désirée ('sobol' ou 'morris') et configurer la méthode en utilisant l'argument `pestpp_opts`.

source: ``'factor'``: a factor limit is used,, i.e., the value of the parameter :math:`b` must be within the limits :math:`|b_0/f| \leq b \leq |fb_0|`, where :math:`b_0` is the parameter value at the start of the iteration and :math:`f` is the value of the PEST control variable ``facparmax`` (=10 by default).
fr_fr: ``'factor'`` : un facteur est utilisé comme limite, soit, la valeur du paramètre :math:`b` doit être dans les limites :math:`|b_0/f| \leq b \leq |fb_0|`, où :math:`b_0` est la valeur du paramètre au début de l'itération et :math:`f` est la valeur de la variable de contrôle de PEST ``facparmax`` (=10 par défaut).

source: ``'fixed'``: constant or non-adjustable parameter.
fr_fr: ``'fixed'`` : paramètre constant ou non-ajustable.

source: ``'log'``: the parameter is log-transformed.
fr_fr: ``'log'`` : on applique une transformation logarithmique au paramètre.

source: ``'none'``: no transformation applied to the parameter.
fr_fr: ``'none'`` : aucune transformation n'est appliquée au paramètre.

source: ``'relative'``: a relative limit is used, i.e., the value of the parameter :math:`b` must fulfill the condition :math:`|b-b_0|/|b_0| \leq r`, where :math:`b_0` is the parameter value at the start of the iteration and :math:`r` is the value of the PEST control variable ``relparmax`` (=10 by default).
fr_fr: ``'relative'`` : une limite relative est utilisée, soit, la valeur du paramètre :math:`b` doit avérer la condition :math:`|b-b_0|/|b_0| \leq r`, où :math:`b_0` est la valeur du paramètre au début de l'itération et :math:`r` est la valeur de la variable de contrôle de ``relparmax`` (=10 par défaut).

source: ``'tied'``: the parameter is tied to another parameter (not implemented in :mod:`cuspy`).
fr_fr: ``'tied'`` : le paramètre est lié à un autre paramètre (option non implémentée dans :mod:`cuspy`).

source: ``control_data``, ``svd_data`` and ``pestpp_opts`` are dictionaries used to set the values of variables in the control data, singular value decomposition and PEST++ control data sections of the pest control file.
fr_fr: ``control_data``, ``svd_data`` et ``pestpp_opts`` sont des dictionnaires utilisés pour configurer les valeurs des variables dans les sections dédiées aux données de contrôle, à la décomposition en valeurs singulières et aux données de contrôle de PEST++ du fichier de contrôle PEST.

source: ``dercom``: integer indicating the line of the "model command line" section in the PEST control file that is used to calculate derivatives for a given parameter.
fr_fr: ``dercom`` : entier qui indique la ligne de la section "model command line" du fichier de contrôle de PEST utilisée pour calculer les dérivées pour un paramètre donné.

source: ``model_command`` is the command line instruction used to run the model.
fr_fr: ``model_command`` est la commande de ligne de commandes utilisée pour exécuter le modèle.

source: ``par_data_file``, ``obs_file`` and ``pred_file`` are space-separated text files used to pass parameter and observation data to the function.
fr_fr: ``par_data_file``, ``obs_file`` et ``pred_file`` sont des fichiers texte séparés par des espaces utilisés pour passer les données des paramètres et des observations a la fonction.

source: ``par_file`` and ``output_file`` are the names of the model's parameter and output files.
fr_fr: ``par_file`` et ``output_file`` sont les noms du fichier de paramètres du modèle et des fichiers de sortie.

source: ``parchglim``: parameter change limit.
fr_fr: ``parchglim`` : limite de changement du paramètre.

source: ``pargp``: parameter group name to which the parameter has been assigned.
fr_fr: ``pargp`` : nom du groupe de paramètres auquel appartient le paramètre.

source: ``parlbnd`` and ``parubnd``: lower and upper bounds of the parameter value.
fr_fr: ``parlbnd`` et ``parubnd`` : seuils inférieur et supérieur de la valeur du paramètre.

source: ``parnme``: parameter name (up to 200 characters, case insensitive).
fr_fr: ``parnme`` : nom du paramètre (jusqu'à 200 caractères, sans distinction de majuscules et minuscules).

source: ``partrans``: parameter transformation.
fr_fr: ``partrans`` : transformation du paramètre.

source: ``parval1``: initial parameter value.
fr_fr: ``parval1`` : valeur initiale du paramètre.

source: ``scale`` and ``offset``: multiplier (1.0 by default) and offset (0.0 by default) to apply to a parameter before being written to a model input file.
fr_fr: ``scale`` et ``offset`` : multiplicateur (1.0 par défaut) et écart (0.0 par défaut) qu'on applique au paramètre avant de l'écrire dans le fichier d'entrée du modèle.

source: ``start_date`` and ``end_date`` correspond to the initial and final dates of the simulation.
fr_fr: ``start_date`` et ``end_date`` correspondent aux dates initiale et finale de la simulation.

source: ``tpl_file``, ``ins_file`` and ``pst_file`` are the names of PEST files created by the function.
fr_fr: ``tpl_file``, ``ins_file`` and ``pst_file`` sont les noms des fichiers PEST créés par la fonction.

source: a Python dictionary.
fr_fr: un dictionnaire Python.

source: a dictionary containing additional options to pass to `pestpp-ies`.
fr_fr: un dictionnaire qui contient options additionnelles à passer à `pestpp-ies`.

source: a dictionary defining options in the control data section of the PEST control file.
fr_fr: un dictionnaire où sont définies les de la section de contrôle du fichier de contrôle PEST.

source: a dictionary defining options in the control data section of the pest file.
fr_fr: un dictionnaire où sont définies les options de la section de contrôle du fichier de contrôle pest.

source: a dictionary used to pass PEST++ options to the PEST control file.
fr_fr: un dictionnaire utilisé pour configurer des options de PEST++ du fichier de contrôle PEST.

source: a dictionary used to pass options to configure the DE method.
fr_fr: un dictionnaire utilisé pour configurer les options de la méthode DE.

source: a dictionary used to pass options to configure the GSA method.
fr_fr: un dictionnaire utilisé pour configurer les options de la méthode GSA.

source: a dictionary used to pass options to configure the `pestpp-swp` options.
fr_fr: un dictionnaire utilisé pour configurer les options de `pestpp-swp`.

source: a dictionary used to pass options to the SVD section of the PEST control file.
fr_fr: un dictionnaire utilisé pour configurer des options de la section SVD du fichier de contrôle PEST.

source: a dictionary used to pass options to the regularization section of the PEST control file.
fr_fr: un dictionnaire utilisé pour configurer des options de la section de régularisation du fichier de contrôle PEST.

source: a dictionary used to pass options to the regularization section of the pest file.
fr_fr: un dictionnaire utilisé pour configurer des options de la section de régularisation du fichier de contrôle PEST.

source: a dictionary used to pass options to the svd section of the pest file.
fr_fr: un dictionnaire utilisé pour configurer des options de la section SVD du fichier de contrôle PEST.

source: a file name.
fr_fr: un nom de fichier.

source: add the `pst_file0` parameter values as a realization.
fr_fr: ajoute les valeurs des paramètres du fichier `pst_file0` comme une réalisation.
